{"pageProps":{"postData":{"id":"deploy-next-js-to-github-pages","contentHtml":"<p>خب اول کار نیاز هست این دو مورد رو توضیح بدم که بدونید داستان از چه قراره :</p>\n<p>سرویس گیت هاب پیجز (Github pages) یه سرویس رایگان برای میزبانی فایل های استاتیک هست (فقط HTML , CSS و JS) که با انتشار فایل های مورد نظرتون روی یک مخزن (Repository) گیت هاب میتونید از اون استفاده کنید .\nخوب همون طور که گفتم استایک هست و شما با سروری سروکار ندارید بنابراین کدهاتون باید به شکلی باشه که نیازی نباشه کل اون یا بخشی ازشون روی وب سرور اجرا بشه.</p>\n<p>( مثلا کد های PHP که نیاز هست وب سرور Apache او رو اجرا کنه و بعد به شما نتیجه رو بده که خروجی رو نمایش بدید )\n<br><br>\nخب حالا نکست جی اس چی (Next js) هست ؟\nیه متافریم ورک (فریم ورکی که بر اساس یه فریم ورک دیگه ساخته شده - توی این مورد بر اساس ریکت ) هست که وظایف اصلیش PreRendering و Code splitting و Static Build هست . ما اینجا با مورد آخرش کار داریم که از نسخه 9.3 به اسم Static Site Generation  یا SSG به نکست اضاف شده . کارش هم این هست که میاد و صفحات استاتیک اَپ شما رو بر اساس کد های ریکتی که زدید میسازه . بعدش می تونید فایل ها رو روی گیت هاب پیجز , Netlify یا سرویس های دیگه آپلود کنید .</p>\n<p>گمونم توضیحات کافی باشه و بریم سر اصل مطلب :</p>\n<h4>مرحله اول</h4>\n<p>کد زیر رو به اسکریپ های فایل package.json اضاف کنید .</p>\n<pre><code class=\"language-javascript\">\"build:ssg\": \"next build && next export\"</code></pre>\n<p>اسکریپت رو توی ترمینال اجرا کنید</p>\n<pre><code class=\"language-bash\">npm run build:ssg </code></pre>\n<p> البته مستقیم هم میتونید کد اول رو اجرا کنید ولی چون قراره خیلی ازش استفاده کنید یه بار تعریفش کنید کارتون راحت تر میشه</p>\n<p>چند دقیقه صبر کنید تا build SSG شما آماده بشه . بعد از آماده شدنش یه پوشه جدید به اسم out ایجاد میشه که خروجی فایل های استاتیک شما هست .</p>\n<h4>مرحله دوم</h4>\n<p>توی این فولد out نیاز داریم که یه فایل بدون نام و فقط پا پسوند <code>.nojekyll</code> ایجاد کنیم\nوظیفه این فایل اینکه به گیت هاب میگه که تمایلی به استفاده از jekyll برای انتشار فایل هام توسطش ندارم .</p>\n<p>اگر از دامین اختصاصی هم دارید استفاده می کنید یادتون نره که فایل .CNAME که حاوی آدرس دامین تون هست رو داخل همین فولدر بزارید </p>\n<h4>مرحله سوم</h4>\n<p> الان همه چیز آماده انشار هست و میتونید با با دستورات زیر کد پروژه روی یک مخزن گیت هاب ببرید</p>\n <pre><code class=\"language-javascript\">git init</code></pre>\n <pre><code class=\"language-javascript\">git add .</code></pre>\n <pre><code class=\"language-javascript\">git commit -m \"Initial commit \" </code></pre>\n <pre><code class=\"language-javascript\">git remote add origin < YOUR REMOTE NAME > </code></pre>\n <pre><code class=\"language-javascript\">git push -u origin master </code></pre>\n<br> \n<h4>لینک های مرتبط</h4>\n<p>اگر هم با گیت هاب پیجز کار نکردید می توانید لینک زیر رو یه بررسی کنید که مربوط به مستندات خودش هست .خیلی تر تمیز توضیح داده و کارتون رو راه میندازه.</p>\n<p>:: <a href=\"https://pages.github.com/\" target=\"_blank\" rel=\"nofollow\">راهنمای استفاده از Github pages</a></p>\n","title":"استقرار (deploy) Next js روی Github pages","date":"1399/3/11","fullTime":"1399/3/11@8:55","img":"/img/deploy-next-js-to-github-pages.jpg","desc":"راستش قراره از اونی که فکر می کنید آسون تر باشه . برای این کار لازمه که  build SSG بگیرید که در ادامه توضیح میدم که چطور میتونید این کار رو انجام بدید ..."}},"__N_SSG":true}